In [2]:
# Step 1: Import necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
# Step 2: Import data and assign it to a variable
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
df = pd.read_csv(url, sep ="|", index_col="user_id")

In [7]:
# Step 3: Getting to know your data
df.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [10]:
# Step 4: Data preprocessing
# Process Gender column: Replace M with 1 and F with 0
df['gender'] = df['gender'].apply(lambda g: 1 if g == 'M' else 0)

In [11]:
# Step 5: Univariate Analysis - Statistical
df.dtypes

age            int64
gender         int64
occupation    object
zip_code      object
dtype: object

In [12]:
# Different occupations in this dataset
df['occupation'].nunique()

21

In [13]:
# Most common occupation
df['occupation'].mode()

0    student
dtype: object

In [15]:
# Distribution of occupation
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [16]:
# basic descriptive statistical features of numerical data
df.describe()

              age      gender
count  943.000000  943.000000
mean    34.051962    0.710498
std     12.192740    0.453772
min      7.000000    0.000000
25%     25.000000    0.000000
50%     31.000000    1.000000
75%     43.000000    1.000000
max     73.000000    1.000000

In [17]:
# basic descriptive statistical features of all data
df.describe(include="all")

               age      gender occupation zip_code
count   943.000000  943.000000        943      943
unique         NaN         NaN         21      795
top            NaN         NaN    student    55414
freq           NaN         NaN        196        9
mean     34.051962    0.710498        NaN      NaN
std      12.192740    0.453772        NaN      NaN
min       7.000000    0.000000        NaN      NaN
25%      25.000000    0.000000        NaN      NaN
50%      31.000000    1.000000        NaN      NaN
75%      43.000000    1.000000        NaN      NaN
max      73.000000    1.000000        NaN      NaN

In [18]:
# Mean age of user
df['age'].mean()

34.05196182396607

In [25]:
# Age with least occurence
df['age'].value_counts().sort_values().head()

7     1
11    1
66    1
73    1
10    1
Name: age, dtype: int64